spec/fixtures/files/household/valid_request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:suh="http://suh.softfair-server.de/suhservice" xmlns:per="https://ws.softfair-server.de/PersistenzService">
  <soapenv:Header/>
  <soapenv:Body>
    <suh:GetHrErgebnis>
      <suh:objHrData>
        <suh:Versicherungsbeginn>2017-01-01</suh:Versicherungsbeginn>
        <suh:Versicherungsablauf>2018-01-01</suh:Versicherungsablauf>
        <suh:Laufzeit>1</suh:Laufzeit>
        <suh:Zahlweise>100</suh:Zahlweise>
        <suh:Zahlungsart>ZAHLART_LSV</suh:Zahlungsart>
        <suh:TARIFAUSWAHL>HREFH</suh:TARIFAUSWAHL>
        <suh:BAUARTKLASSE>1</suh:BAUARTKLASSE>
        <suh:STRASSE>Thingamabob</suh:STRASSE>
        <suh:HAUSNR>2332</suh:HAUSNR>
        <suh:PLZ>12345</suh:PLZ>
        <suh:WOHNORT>Clark Town</suh:WOHNORT>
        <suh:WOHNFLAECHE>50</suh:WOHNFLAECHE>
        <suh:HRVSU>0</suh:HRVSU>
        <suh:HasBMT>false</suh:HasBMT>
        <suh:HasTARIFBEREICHGLAS>true</suh:HasTARIFBEREICHGLAS>
        <suh:HasTARIFBEREICHEL>true</suh:HasTARIFBEREICHEL>
        <suh:HasINKLUEBSCHWMNGSRSKELMNTR>true</suh:HasINKLUEBSCHWMNGSRSKELMNTR>
        <suh:GEBURTSDATUM>1996-12-06</suh:GEBURTSDATUM>
        <suh:SBBETRAGHR>0</suh:SBBETRAGHR>
        <suh:UEBERSPANNUNGSUM>0</suh:UEBERSPANNUNGSUM>
        <suh:UEBERSPANNUNGPROZ>0</suh:UEBERSPANNUNGPROZ>
        <suh:WERTSACHENSUM>0</suh:WERTSACHENSUM>
        <suh:WERTSACHENPROZ>0</suh:WERTSACHENPROZ>
        <suh:HasRSK_WERTSACHENINBANKGEWAHRSAM>false</suh:HasRSK_WERTSACHENINBANKGEWAHRSAM>
        <suh:AUSVERSICHERUNGMONAT>0</suh:AUSVERSICHERUNGMONAT>
        <suh:FAHRRADSUM>0</suh:FAHRRADSUM>
        <suh:HasRISIKO_FAHRRAD24>false</suh:HasRISIKO_FAHRRAD24>
        <suh:HasANPRALLABSTUERTENDERFLUGKOERPER>false</suh:HasANPRALLABSTUERTENDERFLUGKOERPER>
        <suh:HasANPRALLLANDFAHRZEUG>false</suh:HasANPRALLLANDFAHRZEUG>
        <suh:HasANPRALLWASSERFAHRZEUG>false</suh:HasANPRALLWASSERFAHRZEUG>
        <suh:HasAUSLANDSRUECKHOLKOSTEN>false</suh:HasAUSLANDSRUECKHOLKOSTEN>
        <suh:HasCAMPING>false</suh:HasCAMPING>
        <suh:HasDEKONTAMINATIONKOSTEN>false</suh:HasDEKONTAMINATIONKOSTEN>
        <suh:HasDIEBSTAHLAUSKFZ>false</suh:HasDIEBSTAHLAUSKFZ>
        <suh:HasDIEBSTAHLKINDERWAGEN>false</suh:HasDIEBSTAHLKINDERWAGEN>
        <suh:HasDIEBSTAHLKRANKENZIMMER>false</suh:HasDIEBSTAHLKRANKENZIMMER>
        <suh:HasDIEBSTAHLPERSONAL>false</suh:HasDIEBSTAHLPERSONAL>
        <suh:HasDIEBSTAHLROLLSTUHL>false</suh:HasDIEBSTAHLROLLSTUHL>
        <suh:HasDIEBSTAHLEINFACH>false</suh:HasDIEBSTAHLEINFACH>
        <suh:HasEINGEFUEGTEGEGENSTAENDE>false</suh:HasEINGEFUEGTEGEGENSTAENDE>
        <suh:HasPERSOENLAUSLAGEN>false</suh:HasPERSOENLAUSLAGEN>
        <suh:HasGEWERBLICHESACHEN>false</suh:HasGEWERBLICHESACHEN>
        <suh:HasGEFRIERKUEHLGUT>false</suh:HasGEFRIERKUEHLGUT>
        <suh:HasHAUSTIERBETREUUNG>false</suh:HasHAUSTIERBETREUUNG>
        <suh:HasHOTELKOSTEN>false</suh:HasHOTELKOSTEN>
        <suh:HasIMPLOSION>false</suh:HasIMPLOSION>
        <suh:HasINNEREUNRUHEN>false</suh:HasINNEREUNRUHEN>
        <suh:HasNEUWERTENTSCHAEDIGUNG>false</suh:HasNEUWERTENTSCHAEDIGUNG>
        <suh:HasNUTZWAERME>false</suh:HasNUTZWAERME>
        <suh:HasRAUCHURUSS>false</suh:HasRAUCHURUSS>
        <suh:HasREPGMWHG>false</suh:HasREPGMWHG>
        <suh:HasROHRBRUCHWASSERVERLUST>false</suh:HasROHRBRUCHWASSERVERLUST>
        <suh:HasHRRUECKSTAU>false</suh:HasHRRUECKSTAU>
        <suh:HasSACHVERSTAENDIGER>false</suh:HasSACHVERSTAENDIGER>
        <suh:HasSCHLOSSAENDERUNGKOSTEN>false</suh:HasSCHLOSSAENDERUNGKOSTEN>
        <suh:HasSENGSCHAEDENHR>false</suh:HasSENGSCHAEDENHR>
        <suh:HasTASCHENTRICKDIEBSTAHL>false</suh:HasTASCHENTRICKDIEBSTAHL>
        <suh:HasUEBERSCHALLKNALL>false</suh:HasUEBERSCHALLKNALL>
        <suh:HasUMZUGSKOSTEN>false</suh:HasUMZUGSKOSTEN>
        <suh:HasVERPUFFUNG>false</suh:HasVERPUFFUNG>
        <suh:HasEINREDEGROBEFAHRLAESSIGKEIT>true</suh:HasEINREDEGROBEFAHRLAESSIGKEIT>
        <suh:EINREDEGROBEFAHRLAESSIGKEITPRZ>0</suh:EINREDEGROBEFAHRLAESSIGKEITPRZ>
        <suh:HasWASSERAQUARIUM>false</suh:HasWASSERAQUARIUM>
        <suh:HasWASSERREGENFALLROHR>false</suh:HasWASSERREGENFALLROHR>
        <suh:HasWASSERWASSERBETT>false</suh:HasWASSERWASSERBETT>
        <suh:HRGLASFLAECHE>0</suh:HRGLASFLAECHE>
        <suh:HasCERANKOCHFLAECHE>false</suh:HasCERANKOCHFLAECHE>
        <suh:HasSICHTFENSTER>false</suh:HasSICHTFENSTER>
        <suh:HasISOLIERGLAS>false</suh:HasISOLIERGLAS>
        <suh:HasSONNENKOLLEKTOREN>false</suh:HasSONNENKOLLEKTOREN>
        <suh:HasWINTERGARTENGLAS>false</suh:HasWINTERGARTENGLAS>
        <suh:HasERDBEBEN>false</suh:HasERDBEBEN>
        <suh:HasERDFALL>false</suh:HasERDFALL>
        <suh:HasERDRUTSCH>false</suh:HasERDRUTSCH>
        <suh:HasRUECKSTAUSCHADENDURCHNIEDERSCHLAG>false</suh:HasRUECKSTAUSCHADENDURCHNIEDERSCHLAG>
        <suh:HasRUECKSTAUSCHADENOBERIRDSCHERGEWAESSER>false</suh:HasRUECKSTAUSCHADENOBERIRDSCHERGEWAESSER>
        <suh:HasUEBERSCHWAEMMUNGDURCHNIEDERSCHLAG>false</suh:HasUEBERSCHWAEMMUNGDURCHNIEDERSCHLAG>
        <suh:HasUEBERSCHWAEMMUNGOBERIRDISCHRGWASSER>false</suh:HasUEBERSCHWAEMMUNGOBERIRDISCHRGWASSER>
        <suh:HasLAWINEN>false</suh:HasLAWINEN>
        <suh:HasSCHNEEDRUCK>false</suh:HasSCHNEEDRUCK>
        <suh:HasVULKANAUSBRUCH>false</suh:HasVULKANAUSBRUCH>
        <suh:HasVorversicherung>false</suh:HasVorversicherung>
        <suh:HasVorversicherung5jahre>false</suh:HasVorversicherung5jahre>
        <suh:VorschadenAnzahl>0</suh:VorschadenAnzahl>
        <suh:VorschadenElementarAnzahl>0</suh:VorschadenElementarAnzahl>
      </suh:objHrData>
    </suh:GetHrErgebnis>
  </soapenv:Body>
</soapenv:Envelope>
